(CHECK_KEYBOARD)
  @KBD
  D=M      // جلب محتوى مسجل لوحة المفاتيح ووضعه في D

  @BLACKEN
  D;JGT    // إذا كانت قيمة D أكبر من الصفر (تم ضغط زر)، اذهب إلى (BLACKEN)

  @WHITEN
  0;JMP    // إذا كانت قيمة D تساوي صفراً (لم يتم ضغط شيء)، اذهب إلى (WHITEN)

(BLACKEN)
  @color
  M=-1     // تعيين اللون إلى الأسود. (16 بت من الواحدات بالثنائي تساوي -1)
  @FILL
  0;JMP    // اذهب إلى حلقة التلوين

(WHITEN)
  @color
  M=0      // تعيين اللون إلى الأبيض. (16 بت من الأصفار بالثنائي تساوي 0)

(FILL)
  @SCREEN
  D=A      // جلب عنوان أول بكسل في الشاشة (وهو 16384) ووضعه في D
  @ptr
  M=D      // إنشاء متغير مؤشر (ptr) يحمل عنوان البداية

(LOOP)
  @color
  D=M      // جلب قيمة اللون المختار (أسود أو أبيض) ووضعها في D
  
  @ptr
  A=M      // الانتقال إلى عنوان البكسل الذي يشير إليه المؤشر حالياً
  M=D      // تلوين ذلك البكسل (تغيير الـ 16 بت في الذاكرة)

  @ptr
  M=M+1    // زيادة المؤشر بمقدار 1 للانتقال للبكسل التالي

  @24576
  D=A      // جلب عنوان نهاية ذاكرة الشاشة (بداية ذاكرة الكيبورد) وهو 24576
  
  @ptr
  D=M-D    // طرح العنوان الحالي من عنوان النهاية لمعرفة هل وصلنا للنهاية أم لا

  @CHECK_KEYBOARD
  D;JEQ    // إذا وصلنا لنهاية الشاشة، اخرج من الحلقة وعد لفحص الكيبورد مجدداً

  @LOOP
  0;JMP    // إذا لم نصل للنهاية بعد، استمر في تلوين البكسل التالي
